Revit 2024 API
MacroModuleIterator.Reset Method
 Resets the iterator to the initial state.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public virtual void Reset()
Visual Basic
Public Overridable Sub Reset
Visual C++
public:
virtual void Reset()
See Also
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace